OSU CSE Course and TA Database with Web Scraping/grader/app/controllers/course_sections_controller.rb

SELECT "course_sections".* FROM "course_sections"
---
  def index
    @course_sections = CourseSection.all