OSU CSE Course and TA Database with Web Scraping/grader/app/controllers/evaluations_controller.rb

  def index
    @evaluations = Evaluation.all
---
SELECT "evaluations".* FROM "evaluations"

  def create
    @evaluation = Evaluation.new(evaluation_params)

    respond_to do |format|
      if @evaluation.save
---
INSERT INTO "evaluations" ("InstructorName", "StudentName", "CourseNumber", "Dedication", "Performance", "Cooperation", "Initiative", "Communication", "Character", "Responsiveness", "Personality", "Appearance", "WorkHabit", "grader_application_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @evaluation.destroy
---
DELETE FROM "evaluations" WHERE "evaluations"."id" = ?  [["id", 1]]

    def set_evaluation
      @evaluation = Evaluation.find(params[:id])
---
SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]