OSU CSE Course and TA Database with Web Scraping/grader/app/controllers/grader_applications_controller.rb

SELECT "grader_applications".* FROM "grader_applications"
---
  def index
    @grader_applications = GraderApplication.all

INSERT INTO "grader_applications" ("Name", "Email", "GPA", "InterestedCourses", "AvailableTimes", "course_section_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @grader_application = GraderApplication.new(grader_application_params)

    respond_to do |format|
      if @grader_application.save

UPDATE "grader_applications" SET "AvailableTimes" = ?, "updated_at" = ? WHERE "grader_applications"."id" = ?  [["AvailableTimes", "<div>MWF</div>"], ["updated_at", "2020-12-03 18:08:17.961363"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @grader_application.update(grader_application_params)

DELETE FROM "grader_applications" WHERE "grader_applications"."id" = ?  [["id", 2]]
---
  def destroy
    @grader_application.destroy

SELECT "grader_applications".* FROM "grader_applications" WHERE "grader_applications"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_grader_application
      @grader_application = GraderApplication.find(params[:id])